K9DTV/minime-ii-esp32-discord-bot/MiniMe_Discord_Bot_II/discord_rest.cpp
#include "minime.h"
#include "cores.h"
#include "esp_crt_bundle.h"
#include <new>

// Discord REST client lifecycle + messaging (body reader lives in discord_http.cpp).

WiFiClientSecure httpsClient;
bool httpsInUse = false;

bool sendDiscordCmdError(const String& channelId, const String& content, bool suppressEmbeds) {
  noteCmdErrorReply(content.c_str());
  return sendDiscordMessage(channelId, content, suppressEmbeds);
}

// Escape for Discord JSON content (Core 1 only; not reentrant with concurrent send).
static size_t jsonEscape(const char* in, char* out, size_t outSize) {
  size_t o = 0;
  for (size_t i = 0; in[i] && o + 2 < outSize; i++) {
    const char c = in[i];
    if (c == '"' || c == '\\') {
      out[o++] = '\\';
      out[o++] = c;
    } else if (c == '\n') {
      out[o++] = '\\';
      out[o++] = 'n';
    } else if (c == '\r') {
      out[o++] = '\\';
      out[o++] = 'r';
    } else if (c == '\t') {
      out[o++] = '\\';
      out[o++] = 't';
    } else if ((uint8_t)c < 0x20) {
      // skip other controls
    } else {
      out[o++] = c;
    }
  }
  out[o] = '\0';
  return o;
}

bool sendDiscordMessage(const String& channelId, const String& content, bool suppressEmbeds) {
  unsigned long startedAt = millis();

  // Truncate to Discord cap, then escape into fixed buffers (.bss -- Core 1, not reentrant).
  static char raw[DISCORD_CONTENT_MAX + 1];
  static char esc[DISCORD_CONTENT_MAX * 2 + 4];
  static char body[DISCORD_CONTENT_MAX * 2 + 80];
  static char request[DISCORD_CONTENT_MAX * 2 + 400];

  size_t n = content.length();
  if (n > (size_t)DISCORD_CONTENT_MAX) {
    memcpy(raw, content.c_str(), (size_t)DISCORD_CONTENT_MAX - 3);
    raw[DISCORD_CONTENT_MAX - 3] = '.';
    raw[DISCORD_CONTENT_MAX - 2] = '.';
    raw[DISCORD_CONTENT_MAX - 1] = '.';
    raw[DISCORD_CONTENT_MAX] = '\0';
  } else {
    memcpy(raw, content.c_str(), n);
    raw[n] = '\0';
  }
  jsonEscape(raw, esc, sizeof(esc));

  int bodyLen = snprintf(body, sizeof(body),
                         "{\"content\":\"%s\",\"tts\":false%s}",
                         esc,
                         suppressEmbeds ? ",\"flags\":4" : "");
  if (bodyLen < 0 || (size_t)bodyLen >= sizeof(body)) return false;

  int reqLen = snprintf(request, sizeof(request),
                        "POST /api/v10/channels/%s/messages HTTP/1.1\r\n"
                        "Host: discord.com\r\n"
                        "Authorization: Bot %s\r\n"
                        "Content-Type: application/json\r\n"
                        "User-Agent: " MINIME_USER_AGENT "\r\n"
                        "Content-Length: %d\r\n"
                        "Connection: close\r\n\r\n"
                        "%s",
                        channelId.c_str(), BOT_TOKEN, bodyLen, body);
  if (reqLen < 0 || (size_t)reqLen >= sizeof(request)) return false;

  for (uint8_t attempt = 0; attempt < DISCORD_REST_MAX_ATTEMPTS; attempt++) {
    if ((millis() - startedAt) > 60000UL) return false;
    if (!httpsAcquire("discord.com")) return false;
    httpsClient.write((const uint8_t*)request, (size_t)reqLen);
    unsigned long deadline = millis() + 8000UL;
    String statusLine;
    bool chunked = false;
    int contentLength = -1;
    float retryAfterSec = -1.f;
    // pump=true: HB stays alive while waiting for Discord headers / during retry backoff.
    if (!httpsAwaitHeaders(httpsClient, deadline, true, statusLine, chunked, contentLength, &retryAfterSec)) {
      httpsRelease();
      if ((millis() - startedAt) > 60000UL) return false;
      MmLog.print(F("[REST] Discord header timeout attempt "));
      MmLog.print((unsigned)(attempt + 1));
      MmLog.print(F("/"));
      MmLog.println((unsigned)DISCORD_REST_MAX_ATTEMPTS);
      if (attempt + 1 >= DISCORD_REST_MAX_ATTEMPTS) return false;
      unsigned long waitUntil = millis() + DISCORD_HEADER_RETRY_WAIT_MS;
      while ((long)(millis() - waitUntil) < 0) {
        if ((millis() - startedAt) > 60000UL) return false;
        pumpNetWait();
        delay(10);
      }
      continue;
    }
    int code = 0;
    int sp = statusLine.indexOf(' ');
    if (sp >= 0) code = statusLine.substring(sp + 1).toInt();

    if (code >= 200 && code < 300) {
      // Body unused; Connection: close + release discards it.
      httpsRelease();
      return true;
    }

    if (code == 429) {
      // Prefer Retry-After header; else skim JSON body for "retry_after".
      if (retryAfterSec < 0.f) {
        String errBody;
        unsigned long bodyDeadline = millis() + 3000UL;
        if (readHttpBodyAfterHeaders(httpsClient, chunked, contentLength, errBody, bodyDeadline)) {
          int idx = errBody.indexOf("\"retry_after\"");
          if (idx >= 0) {
            int colon = errBody.indexOf(':', idx);
            if (colon >= 0) retryAfterSec = errBody.substring(colon + 1).toFloat();
          }
        }
      }
      httpsRelease();
      if ((millis() - startedAt) > 60000UL) return false;

      unsigned long waitMs = DISCORD_429_WAIT_MIN_MS;
      if (retryAfterSec > 0.f) {
        waitMs = (unsigned long)(retryAfterSec * 1000.f + 0.5f);
      }
      if (waitMs < DISCORD_429_WAIT_MIN_MS) waitMs = DISCORD_429_WAIT_MIN_MS;
      if (waitMs > DISCORD_429_WAIT_MAX_MS) waitMs = DISCORD_429_WAIT_MAX_MS;
      {
        unsigned long elapsed = millis() - startedAt;
        unsigned long remain = (elapsed < 60000UL) ? (60000UL - elapsed) : 0UL;
        if (remain == 0UL) return false;
        if (waitMs > remain) waitMs = remain;
      }

      MmLog.print(F("[REST] Discord 429 attempt "));
      MmLog.print((unsigned)(attempt + 1));
      MmLog.print(F("/"));
      MmLog.print((unsigned)DISCORD_REST_MAX_ATTEMPTS);
      MmLog.print(F(" wait_ms="));
      MmLog.println((unsigned long)waitMs);

      unsigned long waitUntil = millis() + waitMs;
      while ((long)(millis() - waitUntil) < 0) {
        if ((millis() - startedAt) > 60000UL) return false;
        pumpNetWait();
        delay(10);
      }
      continue;
    }

    httpsRelease();
    return false;
  }
  return false;
}

bool httpsConnect(const char* host, uint32_t timeoutMs) {
  httpsClient.stop();
  // Verify server certs. Never setInsecure -- BOT_TOKEN / API keys must not ride MITM TLS.
  // Call after every stop() -- NetworkClientSecure drops the attach callback on stop.
  // Arduino-ESP32 3.3.12+: useBuiltinCACertBundle() (IDF Mozilla bundle in the core).
  // Older 3.x (incl. many IDE installs): setCACertBundle with IDF-linked
  // _binary_x509_crt_bundle_* symbols + size (required since ~3.0.4).
#if defined(ESP_ARDUINO_VERSION) && (ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 3, 12))
  httpsClient.useBuiltinCACertBundle();
#else
  extern const uint8_t rootca_crt_bundle_start[] asm("_binary_x509_crt_bundle_start");
  extern const uint8_t rootca_crt_bundle_end[] asm("_binary_x509_crt_bundle_end");
  httpsClient.setCACertBundle(rootca_crt_bundle_start,
                              (size_t)(rootca_crt_bundle_end - rootca_crt_bundle_start));
#endif
  httpsClient.setTimeout(timeoutMs);
  httpsClient.setHandshakeTimeout((timeoutMs + 999UL) / 1000UL);
  return httpsClient.connect(host, 443);
}

void httpsRelease() {
  httpsClient.stop();
  httpsInUse = false;
}

bool httpsAcquire(const char* host, uint32_t timeoutMs) {
  if (httpsInUse) return false;
  httpsInUse = true;
  if (!httpsConnect(host, timeoutMs)) {
    httpsRelease();
    return false;
  }
  return true;
}

// Returns 0=ok (httpsInUse held until httpsRelease), 1=busy, 2=header timeout, 3=connect/TLS/DNS fail.
uint8_t httpsGetOpen(const char* host, const String& path, unsigned long headerTimeoutMs,
                     bool& outChunked, int& outContentLength,
                     const char* userAgent, const char* extraHeaders) {
  outChunked = false;
  outContentLength = -1;
  if (httpsInUse) return 1;
  if (!httpsAcquire(host)) return 3;
  if (!userAgent || !userAgent[0]) userAgent = MINIME_USER_AGENT;
  String req = String("GET ") + path + " HTTP/1.1\r\n"
               "Host: " + host + "\r\n"
               "User-Agent: " + userAgent + "\r\n";
  if (extraHeaders && extraHeaders[0]) req += extraHeaders;
  req += "Connection: close\r\n\r\n";
  httpsClient.print(req);
  if (!httpSkipHeaders(httpsClient, headerTimeoutMs, outChunked, outContentLength)) {
    httpsRelease();
    return 2;
  }
  return 0;
}

uint8_t httpGetOpen(WiFiClient& client, const char* host, const String& path,
                    unsigned long headerTimeoutMs, bool& outChunked, int& outContentLength) {
  outChunked = false;
  outContentLength = -1;
  if (!client.connect(host, 80)) return 3;
  client.print(String("GET ") + path + " HTTP/1.1\r\n"
               "Host: " + host + "\r\n"
               "User-Agent: " + String(MINIME_USER_AGENT) + "\r\n"
               "Connection: close\r\n\r\n");
  if (!httpSkipHeaders(client, headerTimeoutMs, outChunked, outContentLength)) {
    client.stop();
    return 2;
  }
  return 0;
}

void setHttpOpenError(String& outReport, uint8_t err, const char* label) {
  outReport = String(label);
  if (err == 1) outReport += " busy.";
  else if (err == 2) outReport += " header timeout.";
  else if (err == 3) outReport += " connect/TLS failed.";
  else outReport += " connection failed.";
}

bool discordIdLooksValid(const String& id) {
  if (id.length() < 16) return false;
  for (unsigned int i = 0; i < id.length(); i++) {
    char c = id.charAt(i);
    if (c < '0' || c > '9') return false;
  }
  return true;
}

bool discordRestGet(const String& path, String& outBody, String& outStatus) {
  outBody = "";
  if (!httpsAcquire("discord.com", 15000)) {
    outStatus = httpsInUse ? "busy" : "connect failed";
    return false;
  }
  String request =
    "GET " + path + " HTTP/1.1\r\n"
    "Host: discord.com\r\n"
    "Authorization: Bot " + String(BOT_TOKEN) + "\r\n"
    "Accept: application/json\r\n"
    "Accept-Encoding: identity\r\n"
    "User-Agent: " + String(MINIME_USER_AGENT) + "\r\n"
    "Connection: close\r\n\r\n";
  httpsClient.print(request);

  unsigned long deadline = millis() + 15000UL;
  bool chunked = false;
  int contentLength = -1;
  if (!httpsAwaitHeaders(httpsClient, deadline, false, outStatus, chunked, contentLength)) {
    httpsRelease();
    outStatus = "timeout";
    return false;
  }
  bool ok = readHttpBodyAfterHeaders(httpsClient, chunked, contentLength, outBody, deadline);
  httpsRelease();
  return ok;
}

String guildIdFromChannel(const String& channelId) {
  if (!discordIdLooksValid(channelId)) return "";

  String body, status;
  if (!discordRestGet("/api/v10/channels/" + channelId, body, status)) {
    return "";
  }
  int jsonStart = body.indexOf('{');
  if (jsonStart < 0) {
    return "";
  }
  if (jsonStart > 0) body = body.substring(jsonStart);

  JsonDocument filter;
  filter["guild_id"] = true;
  JsonDocument doc;
  DeserializationError err = deserializeJson(doc, body, DeserializationOption::Filter(filter));
  if (err) {
    return "";
  }
  String gid = doc["guild_id"] | "";
  return gid;
}

bool appendMembersFromGuild(const String& guildId, uint8_t maxToAdd) {
  if (!discordIdLooksValid(guildId)) return false;

  String body, status;
  String path = "/api/v10/guilds/" + guildId + "/members?limit=200";
  if (!discordRestGet(path, body, status)) {
    return false;
  }

  int jsonStart = body.indexOf('[');
  int objStart = body.indexOf('{');
  if (jsonStart < 0 || (objStart >= 0 && objStart < jsonStart)) {
    return false;
  }

  JsonDocument filter;
  filter[0]["nick"] = true;
  filter[0]["user"]["id"] = true;
  filter[0]["user"]["username"] = true;
  filter[0]["user"]["global_name"] = true;
  filter[0]["user"]["bot"] = true;

  // Heap JsonDocument -- not on Core 1 setup/loop stack.
  static JsonDocument* memberDoc = nullptr;
  if (!memberDoc) {
    memberDoc = new (std::nothrow) JsonDocument();
  }
  if (!memberDoc) return false;
  memberDoc->clear();
  // Parse from offset -- avoid body.substring() second large String copy.
  DeserializationError err = deserializeJson(
      *memberDoc, body.c_str() + jsonStart, DeserializationOption::Filter(filter));
  if (err) {
    return false;
  }

  JsonArray members = memberDoc->as<JsonArray>();
  if (members.isNull()) {
    return false;
  }

  uint8_t added = 0;
  for (JsonObject member : members) {
    if (added >= maxToAdd) break;
    int slot = findFreeTrackedSlot();
    if (slot < 0) break;
    if (member["user"]["bot"] == true) continue;
    String uid = member["user"]["id"] | "";
    String name = member["nick"] | "";
    if (name.length() == 0) name = discordDisplayName(member["user"]);
    if (uid.length() == 0 || name.length() == 0) continue;
    if (findUserIndex(uid) >= 0) continue;
    fillTrackedSlot((uint8_t)slot, uid, name);
    added++;
  }

  return added > 0;
}

bool fetchGuildMembersAtStartup() {
  initTrackedUsers();
  cachedGuildCount = 0;
  rememberGuildId(String(BOT_GUILD_ID));
  rememberGuildId(guildIdFromChannel(TARGET_CHANNEL_ID));
  rememberGuildId(guildIdFromChannel(TARGET_CHANNEL_ID1));

  if (cachedGuildCount == 0) {
    return false;
  }

  bool any = false;
  uint8_t share = (cachedGuildCount > 0) ? (MAX_TRACKED_USERS / cachedGuildCount) : MAX_TRACKED_USERS;
  if (share < 1) share = 1;
  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (appendMembersFromGuild(cachedGuildIds[g], share)) any = true;
  }
  for (uint8_t g = 0; g < cachedGuildCount; g++) {
    if (appendMembersFromGuild(cachedGuildIds[g], MAX_TRACKED_USERS)) any = true;
  }
  return any;
}
